const CSS = {
  CSS: {
    'Основы CSS': {
      id: '41',
      jsx: (
        <div>
          <p>
            <b>CSS</b> - каскадная таблица стилей. Язык для формирования
            внешнего вида документа, созданного с помощью языка разметки.
          </p>
          <ul>
            Состоит из:
            <li>
              <b>Селектора</b>
            </li>
            <li>
              <b>Свойства</b>
            </li>
            <li>
              <b>Значения</b>
            </li>
          </ul>
        </div>
      ),
    },
    Псевдоклассы: {
      id: '42',
    },
    Псевдоэлементы: {
      id: '43',
    },
    'CSS препроцессор': {
      id: '44',
    },
  },
}

export default CSS
