const CSS = {
  CSS: {
    'Основы CSS': {
      id: '41',
      jsx: (
        <div>
          <p>
            <b>CSS</b> - каскадная таблица стилей. Язык для формирования
            внешнего вида документа, созданного с помощью языка разметки.
          </p>
          <ul>
            Состоит из:
            <li>
              <b>Селектора</b>
            </li>
            <li>
              <b>Свойства</b>
            </li>
            <li>
              <b>Значения</b>
            </li>
          </ul>
        </div>
      ),
    },
    Псевдоклассы: {
      id: '42',
      jsx: (
        <div>
          <ul>
            Псевдоклассы:
            <li>
              <b>hover</b> - наведение
            </li>
            <li>
              <b>active</b> - зажатие
            </li>
            <li>
              <b>focus</b> - фокус на инпуте
            </li>
            <li>
              <b>visited</b> - посещенная ссылка
            </li>
            <li>
              <b>first-child</b> - обращение к первому элементу в блоке
            </li>
            <li>
              <b>last-child</b> - обращение к последнему элементу в блоке
            </li>
            <li>
              <b>nth-child(номер)</b> - обращение к конкретному элементу
            </li>
          </ul>
        </div>
      ),
    },
    Псевдоэлементы: {
      id: '43',
    },
    'CSS препроцессор': {
      id: '44',
    },
  },
}

export default CSS
