const JSCORE = {
  'JS CORE': {
    'Типы данных JavaScript и структуры данных': {
      id: '51',
    },
    'Var, let или const? Проблемы областей видимости переменных': {
      id: '52',
    },
    'Преобразование типов для примитивов': {
      id: '53',
    },
    'Операторы Сравнения': {
      id: '54',
    },
    'Логические операторы': {
      id: '55',
    },
    'Условное Ветвление: if ?': {
      id: '56',
    },
    'Циклы while и for': {
      id: '57',
    },
    'Конструкция "switch"': {
      id: '58',
    },
    Функции: {
      id: '59',
    },
    'try…catch': {
      id: '510',
    },
    'Строгий режим': {
      id: '511',
    },
    Массивы: {
      id: '512',
    },
    Объекты: {
      id: '513',
    },
    'Сборка Мусора': {
      id: '514',
    },
    This: {
      id: '515',
    },
    'Оператор new': {
      id: '516',
    },
    'Именованное функциональное выражение(Named Function Expression)': {
      id: '517',
    },
    Прототипы: {
      id: '518',
    },
    Классы: {
      id: '519',
    },
    'Асинхронный JavaScript': {
      id: '520',
    },
    Генераторы: {
      id: '521',
    },
    'Модули Иморт Экспорт': {
      id: '522',
    },
    'FetchAPI - Интерфейсывеб API, XMLHttpRequest': {
      id: '523',
    },
    Замыкания: {
      id: '524',
    },
    Рекурсия: {
      id: '525',
    },
  },
}

export default JSCORE
