const React = {
  React: {
    'Виртуальный DOM': {
      id: '61',
      title: 'Виртуальный DOM',
    },
    'Жизненный цикл компонента': {
      id: '62',
      title: 'Жизненный цикл компонента',
    },
    Контекст: {
      id: '63',
      title: 'Контекст',
    },
    'Предохранители(Error Boundary)': {
      id: '64',
      title: 'Предохранители(Error Boundary)',
    },
    'Алгоритм согласования(Reconcilation)': {
      id: '65',
      title: 'Алгоритм согласования(Reconcilation)',
    },
    'Компоненты высшего порядка': {
      id: '66',
      title: 'Компоненты высшего порядка',
    },
    Рефы: {
      id: '67',
      title: 'Рефы',
    },
    Хуки: {
      id: '68',
      title: 'Хуки',
    },
    'Реакт версия 18.0': {
      id: '69',
      title: 'Реакт версия 18.0',
    },
    'Оптимизация производительности': {
      id: '610',
      title: 'Оптимизация производительности',
    },
  },
}

export default React
