const React = {
  React: {
    'Виртуальный DOM': {
      id: '61',
    },
    'Жизненный цикл компонента': {
      id: '62',
    },
    Контекст: {
      id: '63',
    },
    'Предохранители(Error Boundary)': {
      id: '64',
    },
    'Алгоритм согласования(Reconcilation)': {
      id: '65',
    },
    'Компоненты высшего порядка': {
      id: '66',
    },
    Рефы: {
      id: '67',
    },
    Хуки: {
      id: '68',
    },
    'Реакт версия 18.0': {
      id: '69',
    },
    'Оптимизация производительности': {
      id: '610',
    },
  },
}

export default React
